In [1]:
import numpy as np

In [2]:
import pandas as pd

#### The biggest difference between NumPy and Pandas is that pandas is designed for working with tabular or heterogeneous data. *NumPy, as we know, is best suited for working with homogeneously typed numerical array data.*

In [3]:
from pandas import Series, DataFrame

### Series:

#### A Series is a one-dimensional array-like object containing a sequence of values(of similar types to NumPy types) of the same type and an associated array of data labels, called its index.

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index = ["d", "a", "b", "c"])

In [9]:
obj2.array

<PandasArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [10]:
obj2.index

Index(['d', 'a', 'b', 'c'], dtype='object')

In [11]:
obj2["a"]

7

#### Another way to think about a Series is as a fixed-length, ordered dictionary, as it is a mapping of index values to data values. It can be used in many contexts where you might use a dictionary.

#### If we have data in a Python dictionary, we can create a Series from it by passing the dictionary

In [12]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}

In [13]:
obj3 = pd.Series(sdata)

In [14]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

#### When you are only passing a dictionary, the index in the resulting Series will respect the order of the keys according to the dictionary's keys method, which depends on the key insertion order. You can override this by passing an index with the dictionary keys in the order you want them to appear.

In [15]:
states = ["California", "Ohio", "Oregon", "Texas"]

In [16]:
obj4 = pd.Series(sdata, index=states)

In [17]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### DataFrame

#### A DataFrame represents a rectangular table of data and contains an ordered, named collection of columns, each of which can be a different value type(numeric, string, Boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dictionary of Series all sharing the same index.

In [18]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002, 2003],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [19]:
frame = pd.DataFrame(data)

In [20]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [22]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [23]:
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [24]:
frame2 = pd.DataFrame(data, columns = ["year", "state", "pop", "debt"])

In [25]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [26]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [27]:
frame.columns

Index(['state', 'year', 'pop'], dtype='object')

In [28]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [29]:
frame2["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

#### Rows can be retrieved by position or name with the special *iloc* and *loc* attributes

In [30]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [31]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [32]:
frame2.debt =np.arange(6.)

In [33]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

#### The column returned from indexing a DataFrame is a view on the underlying data, not a copy. Thus, any in-place modifications to the series will be reflected in the DataFrame. The column can be explicitly copied with the Series's copy method.

### Another common form of data is a nested dictionary of dictionaries

In [34]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
              "Nevada": {2001: 2.4, 2002: 2.9}}

In [35]:
frame3 = pd.DataFrame(populations)

#### If the nested dictionary is passed to the DataFrame, pandas will interpret the outer dictionary keys as the columns, and the inner keys as the row indices

In [36]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [37]:
frame3.T #Similar to numPy array

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [38]:
pandas_object = pd.Series(np.arange(3), index = ["a", "b", "c"])

In [39]:
index = obj.index

In [40]:
index

RangeIndex(start=0, stop=4, step=1)

In [41]:
index[1:]

RangeIndex(start=1, stop=4, step=1)

#### Index objects are immutable and thus can't be modified by the user. Immutability makes it safer to share Index objects among data structures.

In [42]:
labels = pd.Index(np.arange(3))

In [43]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [44]:
another_pandas_object = pd.Series([1.5, -2.5, 0], index=labels)

In [45]:
another_pandas_object

0    1.5
1   -2.5
2    0.0
dtype: float64

In [46]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [47]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object')

In [48]:
"Ohio" in frame3.columns

True

In [49]:
2003 in frame3.columns

False

In [50]:
frame3.index

Int64Index([2000, 2001, 2002], dtype='int64')

In [51]:
2003 in frame3.index

False

#### *Unlike Python sets, a pandas Index can contain duplicate labels*

### Reindexing

#### An important method on pandas objects is reindex, which means to create a new object with the values rearranged to align the new index.

In [52]:
sample_pandas_object = pd.Series([4.5, 7.2, -5.3, 3.6], index = ["d", "b", "c", "a"])

In [53]:
reindexed_pandas_object = sample_pandas_object.reindex(["a", "b", "c", "d", "e"])

In [54]:
sample_pandas_object

d    4.5
b    7.2
c   -5.3
a    3.6
dtype: float64

In [55]:
reindexed_pandas_object

a    3.6
b    7.2
c   -5.3
d    4.5
e    NaN
dtype: float64

#### *For ordered data like time series, you may want to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such as ffill, which forward-fills the values*

In [56]:
yet_another_pandas_object = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])

In [57]:
yet_another_pandas_object

0      blue
2    purple
4    yellow
dtype: object

In [58]:
yet_another_pandas_object.reindex(np.arange(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [59]:
again_pandas_object = pd.DataFrame(np.arange(9).reshape(3, 3), index=["a", "c", "d"], columns=["Ohio", "Texas", "California"])

In [60]:
again_pandas_object

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [61]:
again_pandas_object_reindex = again_pandas_object.reindex(index = ["a", "b", "c", "d"])

In [62]:
again_pandas_object_reindex

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [63]:
states_list = ["Texas", "Utah", "California"]

In [64]:
again_pandas_object_reindex.reindex(columns = states_list)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [65]:
again_pandas_object_reindex.reindex(states_list, axis="columns")#Similar to the above, only change is the intro of axis keyword

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Selection on DataFrame with loc and iloc

In [66]:
again_pandas_object_reindex.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a         2.0    1.0
d         8.0    7.0
c         5.0    4.0

### Dropping Entries from an Axis

In [67]:
pandas_obj = pd.Series(np.arange(5.), index = ["a", "b", "c", "d", "e"])

In [68]:
pandas_obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [69]:
new_pandas_obj = pandas_obj.drop("c")

In [70]:
new_pandas_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

#### With DataFrame, index values can be deleted from either exis.

In [71]:
df_object = pd.DataFrame(np.arange(16).reshape(4, 4),
                        index = ["Ohio", "Colorado", "Utah", "New York"],
                        columns = ["one", "two", "three", "four"])

In [72]:
df_object

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
df_object.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [74]:
df_object.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [75]:
df_object.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [76]:
df_object.drop(["two", "four"], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [77]:
df_object["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [78]:
df_object[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [79]:
df_object[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [80]:
covid_sample_data = pd.read_excel("/Users/biswajeetparija/Local_Storage/Documents/Covid_sample_dataset_1.xlsx")

In [81]:
covid_sample_data.head()

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00

#### If we want to return specific rows of data (including all columns) - *The below is a specific label based indexing process*

In [82]:
covid_sample_data.loc[0:1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29

In [83]:
covid_sample_data.iloc[0:1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.0

#### The difference between loc and iloc is that loc includes the both the starting and ending points. For example covid_sample_data.loc[0:1] will return both 0th label and 1st label, but with iloc it'll only return the 0th label.

In [84]:
covid_sample_data.iloc[0:len(covid_sample_data)-1]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
...,...,...,...,...,...,...
141,142.0,UTTARAKHAND,PAURI GARHWAL,72,28,11.49
142,143.0,UTTARAKHAND,ALMORA,55,45,10.95
143,144.0,WEST BENGAL,KOLKATA,9,91,13.15
144,145.0,WEST BENGAL,KALIMPONG,25,75,12.50
145,146.0,WEST BENGAL,DARJEELING,37,63,10.13

In [85]:
covid_sample_data.iloc[0:16]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
5,6.0,ASSAM,UDALGURI,50,50,50.00
6,7.0,ASSAM,GOALPARA,83,17,16.67
7,8.0,ASSAM,DARRANG,100,0,11.43
8,9.0,CHANDIGARH,CHANDIGARH,24,76,11.31
9,10.0,CHHATTISGARH,BEMETARA,98,2,26.76
10,11.0,CHHATTISGARH,GAURELLA PENDRA MARWAHI,38,62,19.34
11,12.0,CHHATTISGARH,SURGUJA,80,20,16.72
12,13.0,CHHATTISGARH,DURG,68,32,16.23
13,14.0,CHHATTISGARH,SURAJPUR,96,4,13.21
14,15.0,CHHATTISGARH,KANKER,97,3,12.70
15,16.0,CHHATTISGARH,RAJNANDGAON,97,3,12.33

In [86]:
covid_sample_data[covid_sample_data["Positivity"]>25.00]

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00
5,6.0,ASSAM,UDALGURI,50,50,50.00
9,10.0,CHHATTISGARH,BEMETARA,98,2,26.76
20,21.0,DELHI,EAST,22,78,37.08
21,22.0,DELHI,NORTH WEST,26,74,32.48
22,23.0,DELHI,CENTRAL,21,79,31.93
23,24.0,DELHI,SOUTH,18,82,31.82
24,25.0,DELHI,WEST,35,65,28.89
25,26.0,DELHI,SOUTH EAST,46,54,28.13
26,27.0,DELHI,NEW DELHI,12,88,27.43
27,28.0,DELHI,NORTH,48,52,25.36
34,35.0,HARYANA,YAMUNANAGAR,3,97,45.64
44,45.0,HIMACHAL PRADESH,SIRMAUR,45,55,26.18
45,46.0,HIMACHAL PRADESH,UNA,33,67,25.17
52,53.0,JAMMU AND KASHMIR,ANANTNAG,14,86,32.00
57,58.0,JHARKHAND,SARAIKELA KHARSAWAN,83,17,50.00
58,59.0,JHARKHAND,LOHARDAGA,100,0,35.00
61,62.0,KERALA,ERNAKULAM,58,42,38.73
62,63.0,KERALA,KOLLAM,75,25,33.79
63,64.0,KERALA,IDUKKI,67,33,33.70
64,65.0,KERALA,KOTTAYAM,71,29,32.56
65,66.0,KERALA,WAYANAD,56,44,32.20
66,67.0,KERALA,PATHANAMTHITTA,63,37,31.61
67,68.0,KERALA,KOZHIKODE,43,57,28.50
68,69.0,KERALA,THRISSUR,55,45,28.40
69,70.0,KERALA,PALAKKAD,65,35,25.84
76,77.0,MADHYA PRADESH,ALIRAJPUR,0,100,33.33
77,78.0,MADHYA PRADESH,MANDLA,14,86,28.57
78,79.0,MADHYA PRADESH,SHEOPUR,0,100,28.57
79,80.0,MADHYA PRADESH,BALAGHAT,27,73,27.27
100,101.0,MEGHALAYA,EAST JAINTIA HILLS,100,0,66.67
101,102.0,MIZORAM,AIZAWL,79,21,35.71
136,137.0,UTTARAKHAND,PITHORAGARH,63,37,43.33

In [87]:
covid_sample_data.iloc[2, [0, 1, 2, 5]]

S.No                     3.0
State         ANDHRA PRADESH
District       EAST GODAVARI
Positivity             10.78
Name: 2, dtype: object

In [94]:
covid_sample_data.loc[covid_sample_data["% Contribution of Testing by RAT"]>50, "State"]

2         ANDHRA PRADESH
6                  ASSAM
7                  ASSAM
9           CHHATTISGARH
11          CHHATTISGARH
12          CHHATTISGARH
13          CHHATTISGARH
14          CHHATTISGARH
15          CHHATTISGARH
16          CHHATTISGARH
17          CHHATTISGARH
18          CHHATTISGARH
19          CHHATTISGARH
30                 DELHI
40               HARYANA
46      HIMACHAL PRADESH
47      HIMACHAL PRADESH
48      HIMACHAL PRADESH
49      HIMACHAL PRADESH
50      HIMACHAL PRADESH
51      HIMACHAL PRADESH
53     JAMMU AND KASHMIR
54     JAMMU AND KASHMIR
55     JAMMU AND KASHMIR
56     JAMMU AND KASHMIR
57             JHARKHAND
58             JHARKHAND
60             JHARKHAND
61                KERALA
62                KERALA
63                KERALA
64                KERALA
65                KERALA
66                KERALA
68                KERALA
69                KERALA
70                KERALA
71                KERALA
81        MADHYA PRADESH
94           MAHARASHTRA
98               MANIPUR
99               MANIPUR
100            MEGHALAYA
101              MIZORAM
102             NAGALAND
103               ODISHA
104               ODISHA
106           PUDUCHERRY
107           PUDUCHERRY
109               PUNJAB
114            RAJASTHAN
118            RAJASTHAN
136          UTTARAKHAND
138          UTTARAKHAND
139          UTTARAKHAND
141          UTTARAKHAND
142          UTTARAKHAND
146          Grand Total
Name: State, dtype: object

In [95]:
covid_sample_data.head()

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00

### Function Application and Mapping

In [98]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [99]:
frame

               b         d         e
Utah    0.661796 -0.642346 -0.204372
Ohio    0.246438 -0.228880  0.490916
Texas  -0.729909  0.173539  0.389911
Oregon -1.075247  1.201703 -0.495663

In [100]:
np.abs(frame)

               b         d         e
Utah    0.661796  0.642346  0.204372
Ohio    0.246438  0.228880  0.490916
Texas   0.729909  0.173539  0.389911
Oregon  1.075247  1.201703  0.495663

In [101]:
def f1(x):
    return max(x)

In [106]:
frame.apply(f1, axis='columns') #here axis = 'columns' means to apply the function across columns

Utah      0.661796
Ohio      0.490916
Texas     0.389911
Oregon    1.201703
dtype: float64

### Sorting and Ranking

In [107]:
covid_sample_data.head()

,S.No,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
0,1.0,ANDAMAN AND NICOBAR ISLANDS,NORTH AND MIDDLE ANDAMAN,0,100,100.00
1,2.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14,86,14.29
2,3.0,ANDHRA PRADESH,EAST GODAVARI,81,19,10.78
3,4.0,ARUNACHAL PRADESH,PAPUM PARE,33,67,25.00
4,5.0,ASSAM,LAKHIMPUR,50,50,100.00

In [109]:
covid_sample_data_1 = covid_sample_data.reindex(index=covid_sample_data["S.No"])

In [111]:
covid_sample_data_1 = covid_sample_data_1.drop("S.No", axis=1)

In [112]:
covid_sample_data_1.head()

,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
S.No,,,,,
1.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14.0,86.0,14.29
2.0,ANDHRA PRADESH,EAST GODAVARI,81.0,19.0,10.78
3.0,ARUNACHAL PRADESH,PAPUM PARE,33.0,67.0,25.00
4.0,ASSAM,LAKHIMPUR,50.0,50.0,100.00
5.0,ASSAM,UDALGURI,50.0,50.0,50.00

In [113]:
covid_sample_data_1.sort_index()

,State,District,% Contribution of Testing by RAT,% Contribution of Testing by RTPCR,Positivity
S.No,,,,,
1.0,ANDAMAN AND NICOBAR ISLANDS,SOUTH ANDAMANS,14.0,86.0,14.29
2.0,ANDHRA PRADESH,EAST GODAVARI,81.0,19.0,10.78
3.0,ARUNACHAL PRADESH,PAPUM PARE,33.0,67.0,25.00
4.0,ASSAM,LAKHIMPUR,50.0,50.0,100.00
5.0,ASSAM,UDALGURI,50.0,50.0,50.00
...,...,...,...,...,...
143.0,WEST BENGAL,KOLKATA,9.0,91.0,13.15
144.0,WEST BENGAL,KALIMPONG,25.0,75.0,12.50
145.0,WEST BENGAL,DARJEELING,37.0,63.0,10.13
146.0,Grand Total,NaN,51.0,49.0,5.19
NaN,NaN,NaN,NaN,NaN,NaN

In [116]:
covid_sample_data_1 = covid_sample_data_1.dropna(axis=0)

In [132]:
covid_sample_data_1 = covid_sample_data_1.sort_index(axis=1, ascending=False)

In [134]:
covid_sample_data_1[0:50]

,State,Positivity,District,% Contribution of Testing by RTPCR,% Contribution of Testing by RAT
S.No,,,,,
1.0,ANDAMAN AND NICOBAR ISLANDS,14.29,SOUTH ANDAMANS,86.0,14.0
2.0,ANDHRA PRADESH,10.78,EAST GODAVARI,19.0,81.0
3.0,ARUNACHAL PRADESH,25.00,PAPUM PARE,67.0,33.0
4.0,ASSAM,100.00,LAKHIMPUR,50.0,50.0
5.0,ASSAM,50.00,UDALGURI,50.0,50.0
6.0,ASSAM,16.67,GOALPARA,17.0,83.0
7.0,ASSAM,11.43,DARRANG,0.0,100.0
8.0,CHANDIGARH,11.31,CHANDIGARH,76.0,24.0
9.0,CHHATTISGARH,26.76,BEMETARA,2.0,98.0
10.0,CHHATTISGARH,19.34,GAURELLA PENDRA MARWAHI,62.0,38.0
11.0,CHHATTISGARH,16.72,SURGUJA,20.0,80.0
12.0,CHHATTISGARH,16.23,DURG,32.0,68.0
13.0,CHHATTISGARH,13.21,SURAJPUR,4.0,96.0
14.0,CHHATTISGARH,12.70,KANKER,3.0,97.0
15.0,CHHATTISGARH,12.33,RAJNANDGAON,3.0,97.0
16.0,CHHATTISGARH,10.96,BIJAPUR,0.0,100.0
17.0,CHHATTISGARH,10.62,GARIYABAND,1.0,99.0
18.0,CHHATTISGARH,10.55,MAHASAMUND,4.0,96.0
19.0,CHHATTISGARH,10.24,DANTEWADA,7.0,93.0
20.0,DELHI,37.08,EAST,78.0,22.0
21.0,DELHI,32.48,NORTH WEST,74.0,26.0
22.0,DELHI,31.93,CENTRAL,79.0,21.0
23.0,DELHI,31.82,SOUTH,82.0,18.0
24.0,DELHI,28.89,WEST,65.0,35.0
25.0,DELHI,28.13,SOUTH EAST,54.0,46.0
26.0,DELHI,27.43,NEW DELHI,88.0,12.0
27.0,DELHI,25.36,NORTH,52.0,48.0
28.0,DELHI,20.44,SHAHDARA,57.0,43.0
29.0,DELHI,18.53,SOUTH WEST,64.0,36.0
30.0,DELHI,16.19,NORTH EAST,43.0,57.0
31.0,GOA,19.67,SOUTH GOA,67.0,33.0
32.0,GOA,13.49,NORTH GOA,71.0,29.0
33.0,GUJARAT,10.97,AHMADABAD,76.0,24.0
34.0,HARYANA,45.64,YAMUNANAGAR,97.0,3.0
35.0,HARYANA,24.92,GURUGRAM,75.0,25.0
36.0,HARYANA,24.08,SONIPAT,94.0,6.0
37.0,HARYANA,22.27,REWARI,59.0,41.0
38.0,HARYANA,21.16,ROHTAK,86.0,14.0
39.0,HARYANA,20.61,FARIDABAD,60.0,40.0
40.0,HARYANA,20.06,HISAR,39.0,61.0
41.0,HARYANA,19.16,PANCHKULA,94.0,6.0
42.0,HARYANA,12.45,JIND,95.0,5.0
43.0,HARYANA,11.70,CHARKI DADRI,99.0,1.0
44.0,HIMACHAL PRADESH,26.18,SIRMAUR,55.0,45.0
45.0,HIMACHAL PRADESH,25.17,UNA,67.0,33.0
46.0,HIMACHAL PRADESH,20.61,HAMIRPUR,15.0,85.0
47.0,HIMACHAL PRADESH,18.90,BILASPUR,15.0,85.0
48.0,HIMACHAL PRADESH,15.63,KANGRA,18.0,82.0
49.0,HIMACHAL PRADESH,11.86,LAHUL AND SPITI,0.0,100.0
50.0,HIMACHAL PRADESH,11.51,KINNAUR,0.0,100.0

In [135]:
covid_sample_data_1.index.is_unique

True

In [136]:
covid_sample_data_1.sum()

State                                 ANDAMAN AND NICOBAR ISLANDSANDHRA PRADESHARUNA...
Positivity                                                                      2931.58
District                              SOUTH ANDAMANSEAST GODAVARIPAPUM PARELAKHIMPUR...
% Contribution of Testing by RTPCR                                               8040.0
% Contribution of Testing by RAT                                                 6460.0
dtype: object

In [140]:
covid_sample_data_1.idxmax

<bound method DataFrame.idxmax of                              State  Positivity        District  \
S.No
1.0    ANDAMAN AND NICOBAR ISLANDS       14.29  SOUTH ANDAMANS
2.0                 ANDHRA PRADESH       10.78   EAST GODAVARI
3.0              ARUNACHAL PRADESH       25.00      PAPUM PARE
4.0                          ASSAM      100.00       LAKHIMPUR
5.0                          ASSAM       50.00        UDALGURI
...                            ...         ...             ...
141.0                  UTTARAKHAND       11.49   PAURI GARHWAL
142.0                  UTTARAKHAND       10.95          ALMORA
143.0                  WEST BENGAL       13.15         KOLKATA
144.0                  WEST BENGAL       12.50       KALIMPONG
145.0                  WEST BENGAL       10.13      DARJEELING

       % Contribution of Testing by RTPCR  % Contribution of Testing by RAT
S.No
1.0                                  86.0                              14.0
2.0                                  19.0                              81.0
3.0                                  67.0                              33.0
4.0                                  50.0                              50.0
5.0                                  50.0                              50.0
...                                   ...                               ...
141.0                                28.0                              72.0
142.0                                45.0                              55.0
143.0                                91.0                               9.0
144.0                                75.0                              25.0
145.0                                63.0                              37.0

[145 rows x 5 columns]>

In [141]:
covid_sample_data_1.describe()

,Positivity,% Contribution of Testing by RTPCR,% Contribution of Testing by RAT
count,145.000000,145.000000,145.000000
mean,20.217793,55.448276,44.551724
std,11.667242,32.037290,32.037290
min,10.000000,0.000000,0.000000
25%,11.800000,32.000000,18.000000
50%,16.670000,57.000000,43.000000
75%,25.000000,82.000000,68.000000
max,100.000000,100.000000,100.000000

In [142]:
covid_sample_data_1.corr()

,Positivity,% Contribution of Testing by RTPCR,% Contribution of Testing by RAT
Positivity,1.000000,-0.030696,0.030696
% Contribution of Testing by RTPCR,-0.030696,1.000000,-1.000000
% Contribution of Testing by RAT,0.030696,-1.000000,1.000000

In [143]:
covid_sample_data_1.cov()

,Positivity,% Contribution of Testing by RTPCR,% Contribution of Testing by RAT
Positivity,136.124528,-11.473795,11.473795
% Contribution of Testing by RTPCR,-11.473795,1026.387931,-1026.387931
% Contribution of Testing by RAT,11.473795,-1026.387931,1026.387931